{
    "2215408": {
        "title": "How many warcrimes would you be charged with?",
        "created_at": "2025-12-15T17:46:44.305Z",
        "poster_id": 709176,
        "body_text": "We’ve all done some things in the world, of Warcraft\nSo do you think you’d get to walk free or be executed on the spot?"
    },
    "2216087": {
        "title": "Signs Of Getting Old?",
        "created_at": "2025-12-17T14:30:26.821Z",
        "poster_id": 3193513,
        "body_text": "I used to not mind music in games but I find myself always turning them off or at least turning them down now. I feel overstimulated having both the music and gameplay sometimes. I wonder if this is part of getting older? Do any of you do that?"
    },
    "2210305": {
        "title": "Resubbed for housing and housing only and then saw",
        "created_at": "2025-12-05T13:44:20.625Z",
        "poster_id": 3261185,
        "body_text": "We get a few decor items and everything else worthwhile is locked behind old expansion exalted rep. Why, just why!\nI would happily pay monthly JUST to enjoy my house and decorating it, this is like a dagger to my heart. I don’t want to go grind old quests for a coffee table….\nLet me BUY it. I would pay IRL money for these items don’t force me to play this old outdated game lmao, I just wanted to decorate and enjoy myself!"
    },
    "2015187": {
        "title": "The New World of Warcraft Killer!",
        "created_at": "2024-11-22T12:06:38.395Z",
        "poster_id": 2542898,
        "body_text": "For years I’ve heard rumors of a game being developed or soon to be released that would be so great that it would kill Wow as the number one game of all time. The Wow Killer! I have seen this prophesy spoken of amongst school-mates, co-workers and in the news, and of course in all social media. Even in gaming websites etc. Over the last 20 years Players have theorized that there had to be a Wow killer mmorpg that was coming very soon!\nSo then. Where is it? Some games have been nominated as the hypothesized usurper of Wow’s throne by excited players. Almost with a hysterical glee and enthusiasm. Almost to the level of wishful thinking. People advocating for their own ship to sink, only so they can replace it with a new shiny ship. The next best thing in gaming! But yet nothing. There have been a few mmorpg games that have been released that can be considered adequate as mmorpgs.  But nothing that would rival and dethrone Wow.\nSo is mmorpg development lacking to the point that Wow can not be surpassed? Is the mmorpg industry dying? Or are players these days gravitating to Mobil games? Or is the truth this; that Wow is just that good? And if so, why?"
    },
    "2215899": {
        "title": "Imagine if Blizzard was competent at writing",
        "created_at": "2025-12-16T22:36:00.817Z",
        "poster_id": 765058,
        "body_text": "Imagine if storybeats that should be addressed got addressed, like\nHaving Jaina plus the Orcs and Forsaken actually suffer serious consequences for their actions\nA facton war where it’s actually factions getting to both do stuff rather than Alliance doing a thing once and F-tier character Sylvanas being the only one permitted to act\nRaces actually getting storylines where they’re not being hard carried to the finish line (Imagine Amirdrassil, but the Night Elves actually get to lead the effort)\nImagine an expansion being primarily themed for one group, and not being hijacked by writer’s pets like Anduin. Looks at the current expansion."
    },
    "2214963": {
        "title": "Christmas time",
        "created_at": "2025-12-14T15:42:44.395Z",
        "poster_id": 203253,
        "body_text": "So what are ya gettin and what do ya want this year?\nId like a new PC"
    },
    "2216275": {
        "title": "Deepholm - The most frightening place in WoW?",
        "created_at": "2025-12-18T01:10:47.733Z",
        "poster_id": 3239207,
        "body_text": "Deepholm - to me anyways - is the most terrifying place in in the game. It is in the middle of the Maelstrom.\nThe reason is simple, it is because of the ocean.  The ocean alone in real life is scary enough. It is a dark and unforgiving place that you can be swept into and you can do nothing about. Even when it can be a seemingly calm and fun place in the shallows, it still can devour you… It wants to devour you.\nAnd that is basically Deepholm.\nAnyways, the basic thing is that I am scared of the ocean, and thought this would be a fun topic for others to share what areas they think are a bit “scary” in game, and why?"
    },
    "1631022": {
        "title": "Why does it take 20 seconds to log out?",
        "created_at": "2023-07-13T20:26:19.287Z",
        "poster_id": 375548,
        "body_text": "Why does it take 20 seconds to log out, but will sometimes log out automatically instead? And why can I exit the game instantly? Why then the 20 seconds?"
    },
    "2215896": {
        "title": "New API changes announced in WoW UI Discord",
        "created_at": "2025-12-16T22:28:20.084Z",
        "poster_id": 3209051,
        "body_text": "They will be reverting a large number of API restrictions in the next beta build, and then in January’s post holidays build they will revert another large number of restrictions.\nWhich means addons are officially, once again, superior in every way to the base UI and are once again available to be used in large enough scale in Midnight that most of the problems are now resolved. (Which was inevitable because of how horrendous the base UI STILL was after all of this development and testing)\nWHICH THEN BEGS THE QUESTION: WHY did we waste 2.5 months with this nonsensical disaster and create such a mess of a beta to just walk back most of it and reveal that the devs actually don’t know how to build a functioning UI on par with what addons and WAs have created?"
    },
    "2216166": {
        "title": "Why are the Meeksi mounts *more* expensive than when they released?",
        "created_at": "2025-12-17T20:29:30.095Z",
        "poster_id": 1824325,
        "body_text": "I’m unsure if anyone actually cares, but when Blizzard initially released the 5 Meeksi mounts earlier this year, it was $65 for the pack.\nSeen here: Meeksi 5 pack\nNow on the shop if you want to buy the mounts “30% off” they are 17.50 each, which would put buying all 5 of them at $87.50, a $22.50 increase.\nI get them not originally being popular for 5 mounts for $65, but kind of a slap in the face by Blizzard to think they can increase the price and list it as a “sale’“\nI didn’t buy them then, and I’m not buying them now, but like…. seems like a rip off."
    },
    "2216185": {
        "title": "A housing idea: populate your house with Warband NPCs",
        "created_at": "2025-12-17T21:16:40.714Z",
        "poster_id": 21194,
        "body_text": "I’ve been totally addicted to housing, but there’s something bothering me: how my house is always empty. I’ve been thinking about this and came up with an idea/suggestion for a system to populate our houses with our characters. Hopefully this will reach Blizzard, so Interact with this post to increase the offs of the housing devs at least know of it.\nTLDR: you can Clone your characters as NPCs and set certain activities which they’ll randomly do within your house, making it seem lively.\nPopulating our houses: Clone NPCs\nThe core idea is simple: you can take some of your characters and “clone” them as NPCs that Interact with your home interior. That way, when you or someone else enters your home, the instance is populated with these “Clone NPCs” (I’ll call them “Clones” for short from now on) who wander the rooms and do stuff.\nClone Slots\nEach house has a number of “Clone Slots” that increase with House Levels, though there may be a hard limit to not impact performance. Imagine you start with one Clone Slot and gain another one every odd level (so currently in live we could have up to 3 Clones at House Level 5).\nTo set a Clone Slot, you need to enter your house with a character and apply it to a Clone Slot. The Clone Slot will get the character’s name, title and appearance (transmog plus equipped slots) as of the moment you applied it. To update the Clone’s title or appearance, you need to reapply the same character or overwrite the Slot with another character. The same character can’t occupy more than one Clone Slot.\nClone Behavior (Position Snapshots)\nOnce your Clone Slot is set, any character in your account can set the Clone’s behavior. This is done by Position Snapshots. Each Clone Slot can have up to 5 Position Snapshots set to it.\nTo set up a Position Snapshot,you just have to go to a desired place in your house interior, open the desired Clone Slot, select a Snapshot Position slot, and snapshot your current position. This will save: the current position, current facing Direction, and if the character is sit on an sittable object like a chair or bench.\nOnce a position is saved, you can also apply to it an emote, like /cry, /dance, /cheer, /read, /sleep or any other (except /me), and a range of duration (min and max) in seconds (at least 5 seconds, at most 600 seconds).\nFor instance, imagine you cloned your character, and then you set these positions:\n\nIn the bedroom, on the bed, /sleep, between 180 and 300 seconds.\nIn the library, at a shelve, /read, between 90 and 120 seconds.\nIn the dinner hall, sat on a chair, /eat, between 30 and 90 seconds.\nIn the chapel, at the altar, /kneel, between 15 and 30 seconds.\nIn the main room, near a wall, /lean, between 60 and 150 seconds.\n\nEach Clone Slot has its own Snapshot Positions, they aren’t shared.\nWhen you are in edit mode, you can see the Snapshotted Positions as ghostly Clones with the set appearance executing the chosen emotes, and can select, move, rotate facing or delete them like any other pieace of decor.\nAnd that’s it, with Clones and Positions set, the system is ready to go.\nHow would it work?\nSo, this would be how the system would work in practice:\n\n\nWhen someone enters your home, creating an instance of it, each Clone will spawn in one of it Snapshot Positions, randomly chosen, and execute the designated emote. If the chosen emote has a short duration, they’ll execute it every few seconds. If the emote is continuous (like /sleep, /dance, /sit, /kneel, /lean), they’ll just stay in it for the duration.\n\n\nEach Clone will stay in their positions for a random period between the min and max values set to it. Once that period ends, they walk to another of their Snapshot Positions, chosen randomly. Clones will ignore Positions that they can’t find a path to (they can only walk, not jump or teleport). If there’s no other Position they can reach, they won’t leave their current one.\n\n\nWhen walking, clones will avoid obstacles and try to avoid players and other clones, using pathing tech already existing in the game.\n\n\nInteractable doors do not interfere with Clone pathing. If a door is in the Clone’s path, it will automatically open when the NPC gets near, then close when the NPC moves away from it.\n\n\nOnce a clone reaches its intended Snapshot Position, it will play the corresponding emote. After staying there for its intended duration, it will again randomly choose a new Snapshot Position to walk to.\n\n\nIf a cloned character enters the instance, its Clone will not spawn, if it’s a new instance, or will immediately despawn if it’s an ongoing instance. A Clone will respawn if the clone character leaves the instance for some time (30 seconds to a minute), assuming the instance is kept active long enough for it.\n\n\nPlayers can interact with clones through emotes. Some emotes will prompt the Clone to execute the same action (examples: /wave, /bye, /salute, /bow, /dance, /rude), while some emotes will prompt the Clone to answer with another action (examples: /kiss causes a /shy and vice-versa, /roar causes a /fear and vice-versa, /cheer causes a /clap and vice-versa). Also, /whistle will cause the Clone to move towards the player and stop near it for a few seconds before its normal behavior resumes.\n\n\nOf course, once the instance ends, all Clones despawn. Their locations aren’t saved, they’ll respawn in random positions again the next time the house instance is created.\n\n\nConclusion\nNow, imagine how cool this little system could be. You enter a house, and several Clones of the owner’s characters are walking around, reacting to you, and doing actions in set places of the house. If you enter your own house, your own Warband is wandering within it, making it feel lively. Plus, since this would only affect housing interior, performance issues would be unlikely. Because this does not affect gameplay, Blizzard could even define Clones actions (like define spawning locations, calculate pathing, and choose next positions from the set lists) client-side to reduce server load.\nAlso, since this system benefits from emotes, it would be really cool to have new ones to allow us to do things like play casting animations or assuming combat, stealth or guarding stances. I’ll point out to suggestions I made some time ago in another thread: [Request] New animated emotes.\nWhat are your thoughts?"
    },
    "2204612": {
        "title": "Finally Did Ky'veza (Double) ? Dont Give Up!",
        "created_at": "2025-11-25T01:21:30.394Z",
        "poster_id": 1044637,
        "body_text": "Don’t give up guys I finally did it. I solo’ed her.\nFound the right song to get into the fight, 9 mins (3rd Pull) into Iris Out (by Kenshi Yonezu) on a 30 min loop."
    },
    "2045071": {
        "title": "Press and Hold Casting not working",
        "created_at": "2025-01-15T09:22:22.905Z",
        "poster_id": 2202375,
        "body_text": "Partly I think it’s not working as I expect it to, partly when it does work, it stops working.\nNo macros, no addons, no fancy computer software mimicking macros or anything like that, just a spell from my spell book placed onto my default UI action bar and that’s it. I press the button, sometimes it casts once and stops, sometimes it casts multiple times and keeps casting.\nSometimes I am doing my rotation, hold down a button, press and hold my next spell and sometimes it casts once and stops, sometimes it doesn’t even cast at all.\nHow I think it should work, effectively is to just mimick me spamming my buttons down. Or at least fix it so it works everytime when I am swapping buttons and using other spells, because right now you need to basically spam your second spell and then when it starts casting to hold it down, which is a little silly for some classes where you may only have 2 charges of something, may as well just spam the buttons myself."
    },
    "2213889": {
        "title": "Saddened by instanced housing",
        "created_at": "2025-12-12T05:13:02.647Z",
        "poster_id": 2420408,
        "body_text": "I’m sure there was no way to get player housing that wasn’t instanced.  There are just too many players.  But it saddens me that all this work folks will put in will likely be seen by a small handful of friends and guildmates and no one else.  No wandering around questing and stumbling upon some quaint cottage.  No turning the corner and coming face to face with a gnomish workshop.\nAnd no apartment in Ironforge!  I’ve wanted one of those empty apartments since first stepping foot in in 2004.\nIt would have been a great way to revitalize cities, liven up the world zones, meet new players, and recenter your own server rather than strangers on shards that you’ll never see again.\nJust seems like a missed opportunity to have them instanced, twice no less!  It’s not like I need to actually have shelter and a home in WoW.  I don’t need to cook and eat and sleep and play video games in my video game (ok, maybe that last one).  So there’s not really ever a need to be in my home except to redesign it.  For some folks, I guess that’ll be fun enough.  Built a house, take some pictures, destroy it, and build again.\nI wish they were more connected to the “real” WoW world, and not just mini-games sequestered off to the side.  So much of the game is just an instance.  Housing could have brought the “massive” part back to MMO.  Could have invigorated the world.  Instead, it’s just going to hide folks even more."
    },
    "2216259": {
        "title": "REQUEST: turn on Collector's Bounty buff for Christmas week",
        "created_at": "2025-12-18T00:13:06.216Z",
        "poster_id": 721320,
        "body_text": "Title\nSo I know a lot of people have a short week next week due to Christmas, or multiple days off\nI just think it would be a nice gesture if they flipped a switch and turned Collector’s Bounty buff “on” for Christmas week since a bunch of us will have a lot of free time from said short week. Maybe also just leave the buff turned on until New Year’s eve so we can kill time farming mounts\nPlease?\n"
    },
    "2216262": {
        "title": "Naaru's Enfold (Hearth Stone)",
        "created_at": "2025-12-18T00:18:21.640Z",
        "poster_id": 3270758,
        "body_text": "Am i the only one that doesnt like the way that the character casts it?\nSince it summons a Naaru and it comes from the sky in our direction, the caster should raise both hands and levitate, like it is in the Eternal Traveler’s Hearthstone and Kyrian Hearthstone."
    },
    "2216233": {
        "title": "War fronts should be soloable already",
        "created_at": "2025-12-17T23:16:32.444Z",
        "poster_id": 2928632,
        "body_text": "Its basically 2026. Let me just solo War Front for the transmogs… I cant get 10 ppl every week to do them…"
    },
    "2216260": {
        "title": "Retail is improving but...ready for them to start Classic+",
        "created_at": "2025-12-18T00:13:41.760Z",
        "poster_id": 3270749,
        "body_text": "Coming back to retail and playing around is okay for a bit… Fresh models, updated UI, constant changes and development… Midnight is definitely pushing things in the right direction for the longevity of the game.\nBut retails seems to be a hollow junkyard and running any content of the past is like autopilot brain dead, all quests mobs just die in barely a rotation, even at 60+ then you have elites which dies when you pop everything, nothing really has mechanics until you start running endgame content. It seems like they are starting to improve things little by little making professions relevant with housing is a huge plus. Things like that I like to see….\nBut look at them as a whole. Every Alchemy potion is useless. “Increase armor by 1” cool why even have that in the game files? Blizzard needs to start thinking how they are going to make retail come full circle again and start feeling like a game again because to me at least playing one shot kill at max level 90% of the games content to loot for appearances and mounts is just not very engaging for me.\nHeroic World Tier could be the start. They could start revitalizing the game and chromie time needs to go now, playing in it vs not feels bad. You can’t even see anyone in the open world when you have it on. All this phasing stuff is ridiculous. pushes the community away. Layers also needs to be reduced a bit in some of these old zones.\nAll in all retail is so much work and I can understand the ups and downs through the years of development with all facets of the game. They’ve done better than any other company with their MMO… I think one that would compete the most honestly is Runescape even though I do not like the gameplay… Classic RS is alive and well, the work with the community a lot to vote on content and changes… The modern version while not as popular (although growing because of reduced focus on the cash shop….imagine that….) is still doing great but feels way more bloated and ripped away from what we orginally fell in love with.\nRetail is very bloated. Forced into Dragon Isles is okay I guess… But I’m just wondering how that was the fix? This story and following anything that is going on in this game is close to impossible. You are going to have to do a optional timeline campaign that spans across the games story and you need to really put effort into it. It doesn’t have to be 80 hours long but its very important because I couldn’t tell you what has been going on in the lore with this game since MoP. WoD….even parts of Cata make 0 sense.\nThese issues have went on so long and I’m worried by the end of Last Titan retail’s housing debut will not have been enough to keep the community growing. It’s been stagnant a long time in both Classic, and Retail. Things get better for a bit on releases but then it fades.\nThank you Blizzard for all you do. You really do amazing keeping this game running 20+ years through multiple team shifts etc, writers changing I can’t imagine any other game really being able to stay standing. A lot of people claim its the worst its ever been but for a 20 year old game all you can do if you have a brain is kinda laugh at their delusions.\nI just wanted to give some feedback as a whole. Lots of players come into this game still expecting a RPG of sorts. There is no depth to anything because the latest expansion and some times not even the latest patch. Please keep improving the depth of all items across the game across all expansions and start pushing for a more meaningful experience across the board. Not just the last patch."
    },
    "2211752": {
        "title": "Trespassing in Housing",
        "created_at": "2025-12-07T23:26:53.935Z",
        "poster_id": 2785151,
        "body_text": "If I’m wandering around my neigborhood and get the trespassing notification, it makes me think of that one nasty old person that goes outside to yell at everyone going near their house, or the guy that painted his curb yellow and puts no parking signs to lay claim to public space.\nMy houses are open to all, currently. If someone actually does bother me, I would change up the access to actual house, but don’t care if some walks on my lawn."
    },
    "2215441": {
        "title": "Blizzard, It's Chrimbus time!",
        "created_at": "2025-12-15T18:55:52.322Z",
        "poster_id": 3244368,
        "body_text": "Yo bro..  where is my vendor with the officially licensed Smokywood Pasture’s WoW housing decor Chrimbus tree and meh strings of Chrimbus lights?  Where meh Chrimbus wreath? Meh Chrimbus snowmans?  I’ve seen pics of what players have made and its pretty cool.  You mean to tell me that Smokywood Pasture’s is just gonna forgo that sweet sweet player gold?  C’mon.."
    },
    "2216200": {
        "title": "Change your class/spec!",
        "created_at": "2025-12-17T21:59:06.830Z",
        "poster_id": 3220902,
        "body_text": "You’re allowed to make one change to how your class/spec plays (PVE or PVP). What change would you make, and do you think this change would completely overhaul how the class plays or no?\nI’d let all DK runes recharge simultaneously (Bite me Cata Devs). With how runes work now, I don’t think this would be the biggest deal, i just liked when all our runes were recharging at once."
    },
    "2216217": {
        "title": "Holidays kill immersion",
        "created_at": "2025-12-17T22:54:07.152Z",
        "poster_id": 224181,
        "body_text": "Like come on. Why is there Santa clothes and stuff. Its all so silly in this muscle game of demons and death and war."
    },
    "2216085": {
        "title": "People with alts, how do you choose talents?",
        "created_at": "2025-12-17T14:05:37.802Z",
        "poster_id": 3225632,
        "body_text": "So, recently with timewalking I have finished leveling each class to 80. I am overwhelmed with the talent choices for each class. I find myself just doing “starter build” for each class.\nWhat do other altaholics do when choosing talents?\nAre there any fun talents I should be picking for each class? For example, I loved the shadowlands powers for each class those were fun. Have they all been integrated into each class?"
    },
    "2215903": {
        "title": "They absolutely wasted K'aresh and it bums me out",
        "created_at": "2025-12-16T22:50:19.989Z",
        "poster_id": 222430,
        "body_text": "The aesthetics were some of the prettiest this game has seen, the OST goes so, SO needlessly hard, Manaforge omega is def. a top tier raid for me, and as previously stated, the closure they gave Ve’nari was one of the best things they’ve written in a long time. But compare that to Undermined (Which i personally didn’t care for outside the raid) and it’s so clear it’s not supposed to be there. I was so happy to be my broker bros again, so cool to have tazavesh both as a hub and in the rotation. I enjoyed it but god damn it should have been so much more and it’s so clear it’s not supposed to be there.\nI could have forgiven it for playable ethereals/brokers (particularly the latter because they look so god damn cool w/ shadowform on them) but alas. more re-skinned nelves. yippee… Least I got my space kitty"
    },
    "2176326": {
        "title": "Combat Addons Disabled in End-Game Content in Midnight",
        "created_at": "2025-10-02T03:47:15.024Z",
        "poster_id": 2516847,
        "body_text": "\n\n\nWowhead\n\n\n\nCombat Addons Disabled in End-Game Content in Midnight\nIn a group interview, Game Director Ion Hazzikostas and UX designer Crash Reed confirm that combat addons will be disabled in end-game content in Midnight and imply this may happen as early as the Midnight Pre-Patch!\n\n\n\n\n\nMaybe wait an expansion to see if your in-built versions are up to snuff to the player made add ons."
    },
    "2216062": {
        "title": "Functional Decor",
        "created_at": "2025-12-17T12:17:29.395Z",
        "poster_id": 853316,
        "body_text": "What kind of functional decor can we expect with Midnight launch?  I’d like to have all the functionality of a city; crafting tables, banks, AH."
    },
    "944748": {
        "title": "Taunka Allied Race Megathread",
        "created_at": "2021-04-21T20:10:21.151Z",
        "poster_id": 1042442,
        "body_text": "Welcome to the Taunka Allied Race Megathread!\n{Once I reach a high enough level to post pictures, I will update this post again with some graphics!}\nThe purpose of this post and thread is to voice our support for our friendly Taunka of Northrend to become playable in the game. If you have any suggestions for them or would simply like to voice your support, please comment below! Perhaps one day it will come true.\nBelow I have detailed some general information regarding the Taunka and some ideas I had for their playability.\n\n\nWho are the Taunka?\nThe Taunka are a cousin race of the Tauren that inhabit the continent of Northrend. In Wrath of the Lich King the Horde discovered them and aided them in their defense against the Scourge, who destroyed most of their villages. In the process of it all, the Taunka pledged their loyalty to the Horde.\nThe description given by WoWpedia is below, for the full page please go to WoWpedia’s site(I cannot post links yet).\n“The Taunka are an ancient offshoot of the yaungol and relatives to the tauren who have adapted to the harsh environment in Northrend. Unlike their more peaceful tauren relatives, the Taunka forcibly bend nature and the elements to their will to survive,”\n\n\n\nPotential Arguments Against\nBut that is just another Tauren!\n\nIt is my honest opinion that the Taunka would be one of the most unique Allied Races to be added. They are different physically, culturally and more when you compare them to the Highmountain and Mulgore Tauren(No hate to them! I love them too).\nFrom their general bison-like appearance (rather than the cattle-appearance of the previous two Tauren races), to their hardy and forceful attitudes, they are shown to be more than mere cousins of the Tauren. They bend the elements to THEIR will in order to survive. If they don’t take charge, they’ll die.\n\nBut the females just look like regular Tauren!\n\nYes, that is true. In Wrath they were given the appearance of regular female Taurens, and the males were simply given a mask over the base male Tauren model. This, to me, is just a sign of how things were done in the older expansions of WoW. We were lucky to get females at all for most races.\nIdeally, when the Taunka are made playable they would make the Females match their male counterparts much better. They need to start of scratch making HD models for males anyhow, so mine as well create a female model as well.\nIn recent expansions we have seen the developers create unique female models for almost all races that have appeared, which could mean good news for the Taunka.\n\n{Will add a wonderful fanart picture of a female Taunka once I am able to post pictures}\n\n\n\nTaunka Characters?\nRoanauk Icemist - As mentioned, he is High Chieftain of the Taunka Tribes. During Wrath he was captured by the scourge for a time before the champion rescued him; Afterward he would pledge himself and his people to the Horde. He would likely remain the racial leader and represent the Taunka on the Horde council.\nBanthok Icemist - Son of Roanauk, he is the one who sent the champion to rescue his father during Wrath. He is a natural secondary character to see featured in Horde stories, and is the natural heir to his father if anything would happen to occur.\nGreatmother Icemist - The wife of Roanauk and mother of Banthok, little is known of her, but if delved into she has the potential to be a unique character. We rarely see the wives or mothers of our heroes play a large part in the story; and the developers have rectified that in recent years. Give her a first name and let her stand beside Roanauk.\nToshe Chaosrender - It is unknown if Toshe is affiliated with Roanauk’s Taunka or the Horde, but he is a notable member of the Earthen Ring and could easily show up in neutral content. He previously battled in Vashj’ir.\nTormak the Scarred - Chieftain of Camp Oneqwah Taunka, he joined the Horde alongside his High Chieftain. He later journeyed to alternate Draenor; one of the few Taunka to appear after Wrath. I would love to see these different chiefdoms elaborated upon and made unique within themselves, as we have seen with the various Highmountain tribes.\nChieftain Ashtotem - The Chieftain of Camp Winterhoof, it is noted that he has little interest in friends beyond the Horde. Like I mentioned with Tormak, it would be great to see Ashtotem developed into his own person alongside his own tribe; who are they? What are they about?\nAkiak - A Taunka from Camp Taunka’le, he befriended Trag Highmountain; who helped him defend his village. Akiak’s mate, Buniq, was killed by a Magnataur. A lower-tier character such as Akiak would be ideal to showcase in faction stories on the frontlines.\nOther Chieftains - Many chieftains and villages were lost to the scourge over the years. Were their tribes wiped out and/or absorbed into others? Did new Chieftains rise and lead their scattered people to new homes? It would be interesting to see what happened to these other villages/tribes such as Taunka’le Village and Tunka’lo.\n\n\n\nWhat Faction, Racial Leader and Capital?\nThe Horde - This is kind of straight forward as the Taunka have been members of the Horde since Wrath of the Lich King, longer than most of the playable races for that matter. It wouldn’t make sense for them to be anything else.\nRoanauk Icemist - He is already the Taunka High Chieftain, which is the same title as Mayla and Baine have. He has been the racial leader since before we met them in Wrath until now.\nNewly Built Capital - We learn in the novel Exploring Azeroth: Northrend that the Taunka have decided not to go back to their former central village, Icemist Village, due to the tragedies that have occured there. It would make sense to see the Taunka start to rebuild a new main village in another locale.\n\n\n\nRecruitment Quest Ideas\nTaunka do not require a great elaborate story to induct them into the faction as other races, they are very similar to the Dark Iron Dwarves in that regard. The purpose of the Dark Iron questline was to officially induct them into the Alliance because it never happened in the past.\nThe questline could involve formally inviting the Taunka to sit on the Horde council alongside other races, with some reason given for why they haven’t been before. The champion could journey to Northrend to help start the process of building a new city; help them gather supplies, quell any dangers and so forth.\nI personally would love to see a tauren character to journey with the champion, whether that is Baine, Mayla or a secondary character such as Aponi or Lasan.\nOnce we aid them starting to build their new village, we would travel back to Orgrimmar alongside Roanauk Icemist and whoever may have come to Northrend with us. The rest of the council would be in their chambers when we arrive; a new seat in the circle for Roanauk or whomever he may have represent him on the council.\nIt is simple concept, but as mentioned, bringing the Taunka into the Horde is not overly complicated given their membership in the faction already.\nIf you have other ideas; feel free to comment them!\n\n\n\nClass Ideas\nVERY LIKELY\nWarrior - Every race has access to warriors; Taunka would be no different. Every society needs basic soldiers to defend against their enemies, particularly the Taunka who have frequent assaults from the scourge.\nHunter - Another class available to all races, Taunka no doubt have countless hunters among their ranks. They would need some to defend themselves and hunt for meat and other resources.\nShaman - A class that the Taunka have active lore involving. Compared to their brethren in the Broken Isles and Kalimdor, the Taunka are a lot more forceful with the elements because the harsh elements in Northrend can be more dangerous. They are known to bend the elements to their will, not dissimilar to Dark Shaman. When a dev was asked if Taunka were considered Dark Shaman, they stated “Taunka are Taunka,”\nMonk - One of the new classes available to all races, Taunka have no reason not to be Monks. They have been connected with the larger world for many years; particularly the Horde which has their own monks, who no doubt trained some Taunka.\nMage - Another class available to all races, it seems unlikely that Taunka will be excluded if they are added as a playable race. While it doesn’t seem natural for them; they have many sources to be trained as one after joining the Horde.\nPriest - One of the newer classes available to all races, Taunka would be no different if added. Odds are in terms of story, the Taunka would have learned the ways of the Seer with their interactions with Kalimdor Tauren over the years.\nRogue - A class available to all and requires little elaboration lore-wise. Every race has their sneaky sorts. While I don’t expect any new lore for this combo; it would be cool if there was a Taunka rogue organization who sneaks around the Tundra, blending into the snow and so on.\nWarlock - The latest class made available to all races. Taunka are already more aggressive and willing to bend the rules than their Tauren kin, so them delving into the dark magics for a greater purpose fits them fine.\nDruid - This class has little lore basis for me to elaborate upon; we just know at some point they have learned druidism. We see Taunka druids serve in the Kor’kron during Wrath. I think this could be a chance to make a tauren-related race not tied to the Kaldorei or Cenarion Circle. They did not have contact with such to learn druidism before Wrath, though it is possible they learned quickly during the story.\nSomewhat Likely\nDeath Knight - There is no reason that any race that was actively on Azeroth throughout the last several years in the story would not be able to be Death Knights. Taunka have been around long enough to be in the Wrath-era Death Knight raisings, Legion and BfA-era ones. Game-wise, they could easily be added to the Allied Race(and Pandaren) DK starting area retroactively and have no issues.\nPaladin - While nothing in the lore supports such a class for them explicitly, with the new movement to add all classes to all races, it seems likely that paladins will be added to Taunka if they were made playable. They would likely have learned the ways of the Sunwalker by the Tauren of Kalimdor.\nUnlikely\nDemon Hunter - There is no lore supporting many races as demon hunters, including Taunka. It is not impossible, but until more lore is given and a new starting zone for new demon hunters, it is unlikely more will be added.\nEvoker - They are a special class only available for the Dracthyr and will never become available to other races.\n\n\n\nPotential Mount(s)\nHairy Kodo - Kodos have been seen as their racial mount in Wrath, but I feel like they should specifically be the furred versions due to the climate. We already have the HD models for them, just add some Taunka themed gear to it and we are good!\nVicious Kodo - I know, it isn’t entirely unique since the Tauren have one, but the theme would ultimately be entirely different due to the climate of the Taunka. I am imaging a lot of furs and hides. More leathery instead of flaming wood and so on.\n\n\n\nHunter Pet Possibilities\nShoveltusk - Native to an area where one of the Taunka villages are located, I believe this is a very unique animal that would suit being a starting hunter pet.\nCaribou/Elk - One of the most widespread animals that are around the Taunka villages, it also would be a reasonable option.\n\n\n\nDruid Form Ideas\nTravel Form - Elk or Caribou, similar to what I stated for the hunter pet, they are very numerous and would make sense if Taunka druids would take their form.\nGuardian Form - The woolly rhinos of Northrend would be an ideal fit for Taunka guardians, if they can make it work with the skeleton of a bear.\nFeral Form - No feline animal stood out to me while I was perusing options; but thematically a sort of snow leopard would work for the Taunka.\nBalance Form - Odds are the balance form will be a traditional boomkin with a unique aspect to make it more “Taunka”, such as a pair of distinct horns.\n"
    },
    "2216225": {
        "title": "Any Armor Mog for Anyone",
        "created_at": "2025-12-17T23:10:23.528Z",
        "poster_id": 2684145,
        "body_text": "Just putting it out there that I would love to be able to wear any mog on any toon. We can try them out, so it’s not like it isn’t modeled. I would love to wear some demon hunter gear an literally any other class or the same for DK gear."
    },
    "2216151": {
        "title": "You have been booped!",
        "created_at": "2025-12-17T19:53:16.878Z",
        "poster_id": 7336,
        "body_text": "/BOOP!\nNow deal with it!"
    }
}